import React from "react"
import styled from "styled-components"
import MainLayout from "../Layout/MainLayout"

const Kruesae_mosque_Page = () => {

    const renderKruesae_mosque_Page = () => {
        return (
            <MainLayout>
                <StyledWrapper>
                    <div className="title">
                        <h1>มัสยิดกรือเซะ</h1>
                    </div>
                    <div className="main-content">
                        <div className="img">
                            <img src="https://upload.wikimedia.org/wikipedia/commons/2/2f/OAT_6396.jpg"
                                style={{
                                    width: "1000px",
                                    height: "600px"
                                }}
                            />
                        </div>
                        <div className="description">
                            <h3>ประวัติความเป็นมา</h3>
                            <p>
                                มัสยิดกรือเซะ หรือ มัสยิดสุลต่านมูซัฟฟาร์ชาห์ เป็นมัสยิดเก่าแก่อายุกว่า 200 ปีในจังหวัดปัตตานี ตั้งอยู่ในอำเภอเมืองปัตตานี ห่างจากตัวเมืองประมาณ 6 กิโลเมตร
                                สันนิษฐานได้ว่าเป็นศาสนสถานที่สร้างขึ้นในพุทธศตวรรษที่ 22 ร่วมสมัยกรุงศรีอยุธยา มีชื่อเรียกอีกอย่างหนึ่งว่า มัสยิดปิตูกรือบัน ชื่อนี้เรียกตามรูปทรงของประตูมัสยิด
                                ซึ่งมีลักษณะเป็นวงโค้งแหลมแบบโกธิคของชาวยุโรป และแบบสถาปัตยกรรมของชาวตะวันออกกลาง รูปลักษณะเป็นอาคารก่ออิฐถือปูน สาทรงกลมเลียนรูปลักษณะแบบเสาโกธิคของยุโรป ช่องประตู
                                หน้าต่างมีทั้งแบบโค้งแหลม และโค้งมนแบบโกธิค โดมและหลังคายังก่อสร้างไม่เสร็จ อิฐที่ใช้ก่อมีรูปลักษณะเป็นอิฐสมัยอยุธยา ตรงฐานมัสยิดมีอิฐรูปแบบคล้ายอิฐสมัยทวารวดีปะปนอยู่บ้าง
                            </p>
                            <p>
                                หนังสือสยาเราะห์ปัตตานีของนายหะยี หวันหะซัน กล่าวว่า สุลต่านลองยุนุสเป็นผู้สร้างประมาณปีฮิจเราะห์ ๑๑๔๒ ตรงกับพุทธศักราช ๒๒๖๕ สมัยอยุธยาตอนปลาย
                                เหตุที่ก่อสร้างไม่เสร็จเนื่องจากเกิดสงครามแย่งชิงราชสมบัติระหว่างสุลต่านลองยุนุสกับระตูปะกาลันซึ่งเป็นพระอนุชาของพระองค์ หลังจากสุลต่านลองยุนุสสิ้นพระชนม์แล้ว
                                ระตูปูยุดได้รับตำแหน่งสุลต่านเมืองตานีคนต่อมาได้ย้ายศูนย์การปกครองเมืองตานีไปตั้งอยู่ ณ บ้านปูยุด (ปัจจุบันอยู่ในเขตท้องที่ ตำบลปูยุด อำเภอเมืองปัตตานี) บริเวณที่ตั้งวังของระตูปูยุด
                                ยังคงปรากฏร่องรอยกำแพงอยู่จนบัดนี้ จนไม่มีผู้ใด้คิดสร้างต่อเติมมัสยิดอีกทิ้งไว้รกร้าง ต่อมากรมศิลปากรได้ประกาศขึ้นทะเบียนเป็นโบราณสถาน และทำการบูรณะซ่อมแซม
                                ทั้งนี้เพื่อให้มัสยิดกรือเซะคงสภาพเป็นโบราณสถานที่สำคัญทางประวัติศาสตร์ของเมืองปัตตานี และใช้เป็นที่ปฏิบัติศาสนกิจได้ต่อไป
                            </p>
                            <p>
                                บริเวณด้านหน้าของมัสยิดมีฮวงซุ้ย หรือสุสานที่ฝังศพของ เจ้าแม่ลิ้มกอเหนี่ยว ที่ได้รับการตกแต่งพูนดินใหม่ปรากฏอยู่ มีผู้คนไปกราบไหว้กันมากพร้อมด้วยสิ่งก่อสร้างอื่น ๆ เช่น เก๋งจีน โอ่งน้ำสีแดง มัสยิดกรือเซะนี้
                                อีกหนึ่งตำนานของมัสยิดกรือแซะ เล่ากันว่า สร้างโดยลิ้มโต๊ะเคี่ยม ซึ่งเป็นชาวจีนได้มาแต่งงานกับธิดาพระยาตานีและได้เปลี่ยน มานับ ถือศาสนาอิสลาม ต่อมาน้องสาวของลิ้มโต๊ะเคี่ยมชื่อลิ้มกอเหนี่ยว
                                ได้ลงเรือสำเภามาตามให้พี่ชายกลับ เมืองจีนแต่ไม่สำเร็จ ลิ้มโต๊ะเคี่ยมได้สร้างมัสยิดกรือเซะขึ้น ลิ้มกอเหนี่ยวจึงได้สาปแช่ง ขออย่าให้สร้าง มัสยิดสำเร็จ และตัวเองได้ผูกคอตายที่ต้นมะม่วงหิมพานต์
                                ลิ้มโต๊ะเคี่ยมได้จัดการฝังศพน้องสาวไว้ที่หน้า มัสยิดนี้ ชาวปัตตานีนำต้นไม้ที่ลิ้มกอเหนี่ยวผูกคอตายมาแกะเป็นรูปบูชาและสร้างศาลเจ้า ต่อมาได้มีการ อัญเชิญเจ้าแม่ลิ้มกอเหนี่ยวมาประดิษฐานไว้ ณ ศาลเจ้าแห่งใหม่
                                ตั้งอยู่ที่ถนนอาเนาะรู ในเขตเทศบาล เมืองปัตตานี เรียกว่าศาลเจ้าเล่งจูเกียง ( ศาลเจ้าแม่ลิ้มกอเหนี่ยว) เป็นที่นับถือของชาวปัตตานี และชาวจังหวัด ใกล้เคียง ในเดือน 3 ของทุกปี ( กุมภาพันธ์-มีนาคม )
                                จะมีพิธีเซ่นไหว้และแห่เจ้าแม่ นับว่าเป็นพิธีที่สนุก- สนานมาก ส่วนมัสยิดกรือเซะก็เป็นไปตามคำสาป เพราะไม่สามารถสร้างเสร็จได้ เมื่อจะสร้างต่อก็ให้มีอาเพศ ฟ้าผ่าทุกครั้งไป
                                จนถึงปัจจุบันก็ไม่มีใครกล้าสร้างมัสยิดกรือเซะต่อ คงเหลือซากทิ้งไว้ตราบเท่าทุกวันนี้
                            </p>
                        </div>
                    </div>
                </StyledWrapper>
            </MainLayout>
        )
    }

    return (
        <div>
            {renderKruesae_mosque_Page()}
        </div>
    )
}

const StyledWrapper = styled.div`
    margin: 0;

    .title {
        margin-top: 50px;
        margin-bottom: 50px;
        text-align: center;

        h1 {
            font-family: 'Mitr';
            font-size: 40px;
            font-weight: 900;
        }
    }

    .main-content {
        margin-bottom: 100px;
        margin-left: 100px;
        margin-right: 100px;

        .img {
            display: flex;
            justify-content: center;
        }

        .description {
            margin-top: 50px;
    
            h3 {
                font-family: 'Mitr';
                font-weight: 900;
            }
    
            p {
                font-family: 'Mitr';
                text-indent: 3em;
            }
        }
    }
`
export default Kruesae_mosque_Page