import React from "react"
import styled from "styled-components"
import MainLayout from "../Layout/MainLayout"

const Lim_Ko_Niao = () => {

    const renderLim_Ko_Niao = () => {
        return (
            <MainLayout>
                <StyledWrapper>
                    <div className="title">
                        <h1>ศาลเจ้าแม่ลิ้มกอเหนี่ยว</h1>
                    </div>
                    <div className="main-content">
                        <div className="img">
                            <img src="https://pattaniheritagecity.psu.ac.th/demo/wp-content/uploads/2018/12/47686187_1750317068407740_3509541335180771328_n.jpg"
                                style={{
                                    width: "1000px",
                                    height: "600px"
                                }}
                            />
                        </div>
                        <div className="description">
                            <h3>ประวัติความเป็นมา</h3>
                            <p>
                                ศาลเจ้าแม่ลิ้มกอเหนี่ยวหรือ ศาลเจ้าเล่งจูเกียง เป็นศาลเจ้าเก่าแก่คู่บ้านคู่เมืองของ จ.ปัตตานีมาตั้งแต่โบราณ ตั้งอยู่ที่ถนนอาเนาะรู อำเภอเมือง ปัตตานี เดิมศาลเจ้านี้มีชื่อเรียกว่า "ศาลเจ้าซูก๋ง"
                                ตามหลักฐานที่จารึกอยู่ในศาลเจ้า ตั้งขึ้นในปีปีพุทธศักราช 2117 ในรัชสมัยของสมเด็จพระมหาธรรมราชาแห่งกรุงศรีอยุธยา แม้ศาลเจ้านี้จะตั้งมาเก่าแก่นับได้หลายศตวรรษ แต่ด้วยบุญญาภินิหารของเจ้าแม่หลิมกอเหนี่ยว
                                ศาลเจ้านี้จึงมีความเจริญรุ่งเรืองและเป็นที่ศรัทธาของสาธุชนเสมอมามิได้ขาด
                            </p>
                            <p>
                                เจ้าแม่ลิ้มกอเหนี่ยว ตามตำนานนั้นมีบันทึกไว้ในหลายๆ แหล่ง มีเรื่องราวที่เหมือนๆ กันแต่อาจมีรายละเอียดเล็กๆ น้อยๆ ที่แตกต่างกันไปบ้าง  ตำนานของเจ้าแม่ลิ้มกอเหนี่ยวที่บันทึกไว้ในหนังสือ
                                "เจ้าแม่ลิ้มกอเหนี่ยว ปัตตานี" จัดพิมพ์โดยมูลนิธิเทพปูชนียสถาน ระบุว่า เจ้าแม่เกิดในตระกูล "ลิ้ม" มีชื่อว่า "กอเหนี่ยว" พำนักอยู่ในมณฑลฮกเกี้ยน ประเทศจีน เป็นน้องสาวของ "ลิ้มเต้าเคียน"
                                หรือ "ลิ้มโต๊ะเคี่ยม" เมื่อยังเป็นเด็ก สองพี่น้องได้ศึกษาเล่าเรียนศิลปะแขนงต่างๆ จนแตกฉาน ฝ่ายพี่ชายเมื่อโตขึ้นก็ได้เข้ารับราชการ สร้างผลงานปราบโจรสลัดญี่ปุ่นจนได้รับการแต่งตั้งเป็น "ขุนพลเซ็กกีกวง"
                                คุมกองทัพเรือ แต่ต่อมาเขาถูกใส่ร้ายว่าสบคบกับโจรสลัด จนทางการออกประกาศจับ จึงได้ตีฝ่าวงล้อมของทหารหลวง หนีออกทะเลไปยังเกาะไต้หวัน
                            </p>
                            <p>
                                ลิ้มโต๊ะเคี่ยม เห็นว่าทัพหลวงยังคงติดตามโจมตี ประกอบกับถูกโจรสลัดรังควาญอยู่ตลอด จึงเดินทางต่อไปทางเกาะลูซอน (ฟิลิปปินส์ในปัจจุบัน) แล้วเข้าไปยังเวียดนาม แต่บางตำนานเล่าว่า
                                ลิ้มโต๊ะเคี่ยมเข้าไปอาศัยอยู่ในกรุงศรีอยุธยา และภายหลังจึงได้ย้ายมาตั้งรกรากอยู่ที่เมืองปัตตานี ที่ปัตตานี ลิ้มโต๊ะเคี่ยม ได้ภรรยาเป็นชาวปัตตานีและเข้ารีตเป็นมุสลิมตามภรรยา ฝ่าย ลิ้มกอเหนี่ยว
                                ผู้เป็นน้องสาว เมื่อเห็นว่าพี่ชายขาดการติดต่อ ไม่ได้ส่งข่าวคราวเป็นเวลานาน จนมารดาซึ่งอยู่ในวัยชราล้มป่วยเป็นประจำ ด้วยความกตัญญูจึงอาสาออกเดินทางไปตามพี่ชายให้กลับมาเยี่ยมบ้าน
                            </p>
                            <p>
                                ในวันเดินทาง ลิ้มกอเหนี่ยวได้เข้าไปร่ำลามารดา และลั่นสัจจวาจาไว้ว่า "หากแม้นพี่ชายไม่ยอมกลับมาหามารดาแล้วไซร้ ตนก็จะไม่ขอมีชีวิตอยู่อีกต่อไป"  ลิ้มกอเหนี่ยว กับญาตินำเรือออกทะเลเป็นเวลาหลายเดือน
                                กระทั่งเข้าเขตเมืองปัตตานี ก็ได้จอดทอดสมอไว้ริมฝั่ง ลิ้มกอเหนี่ยว เดินเข้าไปในเมืองและพูดคุยกับชาวบ้านจนได้ความว่า ลิ้มโต๊ะเคี่ยม พี่ชายยังมีชีวิตอยู่ และได้ดิบได้ดีเป็นใหญ่อยู่ที่นี่
                                จึงได้เข้าไปหาและชวนพี่ชายให้กลับไปยังบ้านเกิด  แต่ ลิ้มโต๊ะเคี่ยม ไตร่ตรองดูแล้วเห็นว่าหากกลับไปตอนนี้จะสร้างความลำบากให้แก่ตน เนื่องจากยังติดประกาศจับของทางการ
                                ขณะที่ความเป็นอยู่ทางนี้ก็มีความสมบูรณ์ดีอยู่ จึงตัดสินใจกล่าวกับน้องสาวว่า
                            </p>
                            <p>
                                "ตนหาใช่เนรคุณทอดทิ้งมารดาและน้องสาวไม่ แต่เหตุที่ทางการจีนกล่าวโทษว่าสบคบกับโจรสลัด สร้างความอัปยศจนต้องพลัดพรากมาอยู่ที่นี่ ตนอยู่ทางนี้ก็มีภารกิจมากมาย
                                อีกทั้งได้รับปากกับเจ้าเมืองว่าจะก่อสร้างมัสยิดให้ (มัสยิดกรือเซะ) จึงไม่สามารถกลับไปในขณะนี้ได้" ลิ้มกอเหนี่ยวเมื่อได้ยินดังนั้น ก็คิดว่าจะหาโอกาสอ้วนวอนพี่ชายให้กลับไปให้จงได้
                                จึงขอพำนักอยู่ในปัตตานีต่อ ในขณะนั้นเจ้าเมืองตานีกำลังก่อสร้างมัสยิดเพื่อใช้ประกอบศาสนกิจโดยมอบให้ลิ้มโต๊ะเคี่ยมเป็นนายช่างออกแบบและก่อสร้าง ลิ้มโต๊ะเคี่ยมได้อุทิศกายและใจให้กับงานที่ได้รับมอบหมาย
                                ยิ่งทำให้ลิ้มกอเหนี่ยวเกิดความโกรธและน้อยใจในตัวพี่ชาย พยายามอ้อนวอนพี่ชายให้เห็นแก่มารดาก็ไม่สำเร็จ จึงได้สาบแช่งไว้ว่า "แม้พี่ชายจะมีความสามารถในการก่อสร้างเพียงใดก็ตาม แต่ขอให้สร้างมัสยิดนี้ไม่สำเร็จ"
                                และแอบไปผูกคอตายที่ต้นมะม่วงหิมพานต์ด้านข้างมัสยิดที่กำลังก่อสร้าง
                            </p>
                            <p>
                                ลิ้มโต๊ะเคี่ยมเมื่อสูญเสียน้องสาวก็เสียใจมาก จึงจัดการศพตามประเพณีอย่างสมเกียรติ พร้อมกับสร้างฮวงซุ้ยขึ้นที่ "หมู่บ้านกรือเซะ" แล้วทำการก่อสร้างมัสยิดต่อไปจนเกือบเสร็จอยู่ในขั้นก่อสร้างโดมหลังคา
                                วันหนึ่งเกิดเหตุการณ์ไม่คาดฝัน ฟ้าผ่าลงมายังโดมที่กำลังสร้างจนเสียหายหมดทั้งๆที่ไม่มีวี่แววพายุฝนแต่อย่างใด ลิ้มโต๊ะเคี่ยมจึงทำการก่อสร้างโดมหลังคาใหม่ แต่แล้วสิ่งที่ไม่คาดคิดก็เกิดขึ้นอีก
                                คือเกิดฟ้าผ่าลงมายังยอดโดมอีกครั้ง ทำให้ลิ้มโต๊ะเคี่ยมนึกถึงคำสาบแช่งของลิ้มกอเหนี่ยวขึ้นได้ จึงเกิดความท้อใจเลิกล้มการก่อสร้างมัสยิดเพราะคิดว่าคำสาบแช่งของน้องสาวมีความศักดิ์สิทธิ์
                            </p>
                            <p>
                                เล่ากันว่า ลิ้มก่อเหนี่ยว ได้สำแดงความศักดิ์สิทธิ์ให้เป็นที่ประจักษ์แก่ชาวเรือและผู้สัญจรไปมาในแถบนั้นเสมอ จนเป็นที่เลืองลือไปทั่ว
                                เป็นเหตุให้ประชาชนที่เลื่อมใสศรัทธาได้นำกิ่งต้นมะม่วงหิมพานต์ที่นางใช้ผูกคอตายมาแกะสลักเป็นรูปบูชาไว้สักการะและสร้างศาลให้เป็นที่ประดิษฐานรูปบูชา
                                พร้อมกับขนานนามว่า "ศาลเจ้าแม่ลิ้มกอเหนี่ยว" ปรากฏว่าเมื่อตั้งศาลแล้ว ก็มีผู้คนหลั่งไหลไปกราบไหว้กันมากมาย ใครมีเรื่องเดือดร้อนก็ไปบนบานให้เจ้าแม่ช่วย
                                บ้างก็กราบไหว้ขอให้ทำมาค้าขายเจริญ  แล้วก็บังเกิดผลตามความปรารถนาแทบทุกคน ทำให้ความศักดิ์สิทธิ์ของเจ้าแม่ลิ้มกอเหนี่ยวเลื่องลือไปยังเมืองต่างๆ
                            </p>
                            <p>
                                ต่อมา พระจีนคณานุรักษ์ (ตันจูล่าย ต้นสกุล "คณานุรักษ์") เห็นว่าศาลเจ้าแม่ตั้งอยู่ที่บ้านกรือเซะ ไม่สะดวกในการประกอบพิธี จึงทำการบูรณะศาลเจ้าซูก๋ง บนถนนอาเนาะรู
                                ในตัวเมืองปัตตานี และได้อัญเชิญองค์เจ้าแม่ลิ้มก่อเหนี่ยวมาประดิษฐาน ภายหลังมีชื่อว่า "ศาลเจ้าเล่งจูเกียง" (ศาลเทพเจ้าแห่งความเมตตา) หรือที่ชาวบ้านเรียกกันว่า
                                "ศาลเจ้าแม่ลิ้มกอเหนี่ยว" มากระทั่งทุกวันนี้
                            </p>
                        </div>
                    </div>
                </StyledWrapper>
            </MainLayout>
        )
    }

    return (
        <div>
            {renderLim_Ko_Niao()}
        </div>
    )
}

const StyledWrapper = styled.div`
    margin: 0;

    .title {
        margin-top: 50px;
        margin-bottom: 50px;
        text-align: center;

        h1 {
            font-family: 'Mitr';
            font-size: 40px;
            font-weight: 900;
        }
    }

    .main-content {
        margin-bottom: 100px;
        margin-left: 100px;
        margin-right: 100px;

        .img {
            display: flex;
            justify-content: center;
        }

        .description {
            margin-top: 50px;

            h3 {
                font-family: 'Mitr';
                font-weight: 900;
            }

            p {
                font-family: 'Mitr';
                text-indent: 3em;
            }
        }
    }

`

export default Lim_Ko_Niao