import React from "react"
import MainLayout from "../Layout/MainLayout"
import styled from "styled-components"

const Sai_Khao_Component = () => {

    const renderSai_Khao_Component = () => {
        return (
            <MainLayout>
                <StyledWrapper>
                    <div className="title">
                        <h1>น้ำตกทรายขาว</h1>
                    </div>
                    <div className="main-content">
                        <div className="img">
                            <img src="https://lh3.googleusercontent.com/proxy/Hi69AtP1DQXW80kNb89wt3h7kohmremA4RJJ0xZjIxjiWioJekKkR1-ysXJdpmlp0C0qkvEGVZP_aynjZevYV5PYfdU0xpicXb96rkR-gDijUKFS5Q"
                                style={{
                                    width: "1000px",
                                    height: "600px"
                                }}
                            />
                        </div>
                        <div className="description">
                            <h3>ประวัติความเป็นมา</h3>
                            <p>
                                น้ำตกทรายขาว เดิมเรียกว่า “น้ำตกกระโถน” ซึ่งมีต้นน้ำเกิดจากยอดเขานางจันทร์ในบริเวณทิวเขาทรายขาว ทิวเขาสันกาลาคีรี และถูกค้นพบโดย “พระครูศรีรัตนากร (ท่านสีแก้ว)” ซึ่งเป็นเจ้าเจ้าอาวาสอยู่วัดทรายขาว
                                เมื่อปี 2475 บริเวณอุทยานแห่งชาติน้ำตกทรายขาวมีพื้นที่ครอบคลุมป่าสงวนแห่งชาติเขาใหญ่ ในท้องที่อำเภอโคกโพธิ์ จังหวัดปัตตานี อำเภอเมืองยะลา อำเภอยะหา จังหวัดยะลา
                                และป่าสงวนแห่งชาติป่าเทือกเขาสันกาลาคีรีในท้องที่อำเภอสะบ้าย้อย จังหวัดสงขลา มีจุดเด่นตามธรรมชาติและน้ำตกที่สวยงาม ซึ่งมีสภาพป่าอุดมสมบูรณ์
                                ร่มรื่นไปด้วยพันธุ์ไม้และสัตว์ป่านานาชนิดที่ควรแก่การศึกษาหาความรู้เป็นอย่างมาก ซึ่งมีเนื้อที่ครอบคลุมประมาณ 68,750 ไร่
                                หรือกว่า 110 ตารางกิโลเมตร
                            </p>
                            <p>
                                อุทยานแห่งชาติน้ำตกทรายขาวอยู่ในความรับผิดชอบดูแลของสำนักงานป่าไม้เขตปัตตานี เนื่องจากวนอุทยานทั้ง 2 แห่ง มีบริเวณอาณาเขตติดต่อกัน กรมป่าไม้จึงได้มีคำสั่งที่ 1759/2528
                                ลงวันที่ 6 พฤศจิกายน พ.ศ. 2528 ให้ นายตระกูล คุณาพัทธิ์ นักวิชาการป่าไม้ 7 หัวหน้าฝ่ายจัดการวนอุทยาน ไปสำรวจหาข้อมูลวนอุทยานทั้ง 2 แห่ง และบริเวณใกล้เคียงเพื่อรวมพื้นที่วนอุทยานทั้ง 2 แห่ง
                                จัดตั้งเป็นอุทยานแห่งชาติ และต่อมา นายปรีชา บุญมี สมาชิกสภาผู้แทนราษฎร จังหวัดปัตตานี และ นายเกรียงศักดิ์ ศักดิ์คเชนทร์ สมาชิกสภาจังหวัดปัตตานี
                                ได้มีหนังสือลงวันที่ 23 มีนาคม พ.ศ. 2530 ถึง พลเอกหาญ ลีลานนท์ รัฐมนตรีว่าการกระทรวงเกษตรและสหกรณ์ สนับสนุนให้รวบรวมวนอุทยานทั้ง 2 แห่ง และขอให้สำรวจบริเวณน้ำตกอรัญวาริน
                                ซึ่งอยู่ใกล้เคียงกันรวมจัดตั้งเป็นอุทยานแห่งชาติด้วย
                            </p>
                            <p>
                                ตามรายงานผลการสำรวจตามหนังสือที่ กษ 0713/005 ลงวันที่ 30 เมษายน 2530 สรุปได้ว่า เห็นสมควรผนวกพื้นที่วนอุทยานทั้ง 2 แห่ง เข้าด้วยกันเนื่องจากอยู่ใกล้กันและเป็นทิวเขาเดียวกัน
                                เหมาะที่จะจัดตั้งเป็นอุทยานแห่งชาติ กองอุทยานแห่งชาติได้มีหนังสือที่ กษ.0713/508 ลงวันที่ 1 มิถุนายน พ.ศ. 2530 เสนอกรมป่าไม้ โดย นายไพโรจน์ สุวรรณกร รองอธิบดีกรมป่าไม้
                                ปฏิบัติหน้าที่แทนอธิบดีกรมป่าไม้ ได้มีบันทึกสั่งการลงวันที่ 1 มิถุนายน พ.ศ. 2530 ให้กองอุทยานแห่งชาติดำเนินการยกฐานะรวบรวมวนอุทยานทั้ง 2 แห่ง นี้เป็นอุทยานแห่งชาติ
                                กองอุทยานแห่งชาติจึงได้มีหนังสือด่วนมาก ที่ กษ 0713/950 ลงวันที่ 9 กันยายน พ.ศ. 2530 เสนอโดยกรมป่าไม้มีคำสั่งที่ 1477/2530 ลง วันที่ 9 กันยายน พ.ศ. 2530 ให้ นายอุดม ยกฉวี
                                เจ้าพนักงานป่าไม้ 4 ไปดำเนินการสำรวจและจัดตั้งป่าเขาใหญ่ ในท้องที่ตำบลป่าบอน (ปัจจุบันแยกเป็นตำบลช้างให้ตก) ตำบลนาประดู่ ตำบลทรายขาว ตำบลทุ่งพลา ตำบลปากล่อ อำเภอโคกโพธิ์
                                จังหวัดปัตตานี ตำบลพะยา อำเภอเมืองยะลา ตำบลตาชี อำเภอยะหา จังหวัดยะลา และป่าเทือกเขาสันกาลาคีรี ในท้องที่ตำบลบ้านโหนด ตำบลเปียน ตำบลธารคีรี อำเภอสะบ้าย้อย จังหวัดสงขลา ให้เป็นอุทยานแห่งชาติ
                            </p>
                            <h3>ลักษณะภูมิประเทศ</h3>
                            <p>
                                อุทยานแห่งชาติน้ำตกทรายขาวมีพื้นที่ทั้งหมดอยู่บริเวณทิวเขาสันกาลาคีรีซึ่งเป็นทิวเขายาวที่สลับซับซ้อนติดต่อกัน มียอดเขานางจันทร์เป็นยอดเขาที่สูงที่สุด ส่วนใหญ่พื้นที่จะลาดลงไปทางทิศตะวันตก เป็นที่เนินเขา
                                และเป็นที่ราบ ดินจะเป็นดินเหนียวปนทราย หินเป็นปูนและหินแกรนิต เป็นต้นกำเนิดของห้วยทรายขาว ห้วยโผงโผง ห้วยบอน ห้วยแกแดะ ห้วยลำหยัง ห้วยคลองเรือ ห้วยต้นตะเคียน ห้วยลำชิง ห้วยลำพะยา ฯลฯ
                                ซึ่งลำห้วยลำธารเหล่านี้จะไหลมารวมกันเป็นแม่น้ำเทพา
                            </p>
                            <h3>ลักษณะภูมิอากาศ</h3>
                            <p>
                                อุทยานแห่งชาติน้ำตกทรายขาวจะมีสภาพภูมิอากาศมรสุมตะวันตกเฉียงใต้และลมมรสุมตะวันออกเฉียงเหนือพัดผ่าน ฤดูฝนอยู่ระหว่างเดือนพฤษภาคม-เดือนมกราคม จะมีฝนตกตลอด
                                แต่จะตกชุกในช่วงเดือนตุลาคม-เดือนธันวาคม และฤดูร้อนจะอยู่ระหว่างเดือนกุมภาพันธ์-เดือนเมษายน อากาศจะไม่ร้อนจัดนัก
                            </p>
                            <h3>พืชพรรณและสัตว์ป่า</h3>
                            <p>
                                อุทยานแห่งชาติน้ำตกทรายขาวมีสภาพพื้นที่ปกคลุมด้วยป่าดิบชื้นที่อุดมสมบูรณ์ ชนิดไม้ที่สำคัญได้แก่ สยา กระบาก ยาง กาลอ หลุมพอ ไข่เขียว สะตอ เหรียง ตะเคียนทอง ฯลฯ
                                พืชพื้นล่างได้แก่ ระกำ หวาย เฟิน เถาวัลย์ และกล้วยไม้ชนิดต่างๆ สัตว์ป่าที่พบได้แก่หมูป่า เลียงผา เก้ง อีเห็น เม่น กระจง ลิง ค่าง ชะนี กระรอก นกขุนทอง นกกางเขน นกปรอด เหยี่ยว นกดุเหว่า
                                ตะพาบน้ำ งูเหลือม งูเห่า งูกะปะ ตะกวด กบ เขียด กงรวมทั้งกุ้ง ปู และปลาชนิดต่างๆ ที่อาศัยอยู่ในลำห้วยลำธาร
                            </p>
                        </div>
                    </div>
                </StyledWrapper>
            </MainLayout>
        )
    }

    return (
        <div>
            {renderSai_Khao_Component()}
        </div>
    )
}

const StyledWrapper = styled.div`
    margin: 0;

    .title {
        margin-top: 50px;
        margin-bottom: 50px;
        text-align: center;

        h1 {
            font-family: 'Mitr';
            font-size: 40px;
            font-weight: 900;
        }
    }

    .main-content {
        margin-bottom: 100px;
        margin-left: 100px;
        margin-right: 100px;

        .img {
            display: flex;
            justify-content: center;
        }

        .description {
            margin-top: 50px;
    
            h3 {
                font-family: 'Mitr';
                font-weight: 900;
            }
    
            p {
                font-family: 'Mitr';
                text-indent: 3em;
            }
        }
    }

`

export default Sai_Khao_Component