import React from "react"
import MainLayout from "../Layout/MainLayout"
import styled from "styled-components"

const SomdetPark_Page = () => {

    const renderSomdetPark_Page = () => {
        return (
            <MainLayout>
                <StyledWrapper>
                    <div className="title">
                        <h1>สวนสมเด็จพระศรีนครินทร์ ปัตตานี</h1>
                    </div>
                    <div className="main-content">
                        <div className="img">
                            <img src="https://www.thailandtourismdirectory.go.th/th/file/get/file/20171108a43683d33b40f413228d54e3c6ed4a2f173322.jpg"
                                style={{
                                    width: "1000px",
                                    height: "600px"
                                }}
                            />
                        </div>
                        <div className="description">
                            <h3>ประวัติความเป็นมา</h3>
                            <p>
                                สวนสมเด็จพระศรีนครินทร์ ปัตตานี คือ สวนสาธารณะเฉลิมพระเกียรติสมเด็จพระศรีนครินทราบรมราชชนนี 80 พรรษา ลำดับที่ 12 ตั้งอยู่ที่ชายหาดทะเล ตำบลรูสะมิแล อำเภอเมืองปัตตานี จังหวัดปัตตานี
                                มีเนื้อที่เดิม 155 ไร่ ปัจจุบันสืบเนื่องจากการเจริญงอกงามของป่าชายเลนทำให้ชายหาดงอกได้เนื้อที่เพิ่มขึ้นเรื่อยๆ ที่ละน้อย สมเด็จพระเจ้าพี่นางเธอ เจ้าฟ้ากัลยาณิวัฒนา กรมหลวงนราธิวาสราชนครินทร์
                                เสด็จเป็นประธานเปิดสวนเมื่อวันที่ 21 สิงหาคม พ.ศ. 2537 หน่วยงานรับผิดชอบในการดูแลรักษา คือ เทศบาลเมืองปัตตานี ต้นไม้ประจำสวน คือ สารภีทะเล
                            </p>
                            <h3>ลักษณะของสวน</h3>
                            <p>
                                ลักษณะพื้นที่เดิม เมื่อแรกสร้าง พื้นที่มีลักษณะเปิดโล่งมองเห็นชายหาดที่เป็นเลนที่อยู่ใกล้ได้ชัดเจน มีต้นแสม โกงกางและพืชป่าชายเลนขึ้นประปราย มีสัตว์ทะเลเล็ก ๆ น้อย ๆ พอให้ได้แลเห็น
                                ทะเลมีลักษณะเปิดโล่ง หากมีพายุรุนแรงหรือคลื่นสูงจะไม่มีสิ่งใดช่วยบรรเทา
                            </p>
                            <p>
                                ปัจจุบัน จากการสร้างให้เป็นสวน ต้นไม้ป่าชายเลนต่าง ๆ ได้เจริญงอกงามและเติมโตขยายอาณาเขตจับดินเลนให้ตื้นเขินทำให้แผ่นดินงอกเกิดประโยชน์ด้านนิเวศวิทยาเป็นอย่างดียิ่ง
                                สวนสมเด็จพระศรีนครินทร์ ปัตตานีจึงเป็นสวนที่สามารถใช้เป็นที่ศึกษาระบบนิเวศป่าชายเลนและเป็นที่พักพิงและอยู่อาศัยของนกและสัตว์ป่าชายเลนนานาชนิด สวนสมเด็จพระศรีนครินทร์
                                ปัตตานีในปัจจุบันได้กลายเป็นที่พักผ่อนหย่อนใจของชาวเมืองตั้งแต่ยามเช้าจนถึงยามเย็น
                                มีผู้คนจำนวนมากมาออกกำลังกายรับอากาศบริสุทธิ์และเพลิดเพลินกับแสงอาทิตย์สีทองยามขึ้นจากขอบฟ้าและสีแดงส้มยามลาลับในตอนเย็น
                            </p>
                            <h3>สวนในพื้นที่ใกล้เคียง</h3>
                            <p>
                                บริเวณใกล้เคียงสวนสมเด็จพระศรีนครินทร์แห่งนี้ยังมีสวนอีก 2 แห่งประชิดอยู่ ได้แก่สวนสาธารณะชื่อ "เจ้าทะเล" ขนาด 23 ไร่ และ "สวนแม่-สวนลูก"
                                ซึ่งเป็นสวนที่สร้างเฉลิมพระเกียรติสมเด็จพระเจ้าพี่นางเธอ เจ้าฟ้ากัลยาณิวัฒนา กรมหลวงนราธิวาสราชนครินทร์ในวาระครบรอบ 80 พรรษา
                            </p>
                            <h3>พระราชานุสาวรีย์</h3>
                            <p>
                                ภายในสวนมีพระราชานุสาวรีย์สมเด็จพระศรีนครินทราบรมราชชนนี โดยพระบาทสมเด็จพระเจ้าอยู่หัวโปรดเกล้าฯ ให้สมเด็จพระเทพรัตนราชสุดาฯ
                                สยามบรมราชกุมารีเสด็จเป็นประธานในพระราชพิธีเปิดเมื่อวันที่ 2 กันยายน พ.ศ. 2537
                            </p>
                        </div>
                    </div>
                </StyledWrapper>
            </MainLayout>
        )
    }

    return (
        <div>
            {renderSomdetPark_Page()}
        </div>
    )
}

const StyledWrapper = styled.div`
    margin: 0;

    .title {
        margin-top: 50px;
        margin-bottom: 50px;
        text-align: center;

        h1 {
            font-family: 'Mitr';
            font-size: 40px;
            font-weight: 900;
        }
    }

    .main-content {
        margin-bottom: 100px;
        margin-left: 100px;
        margin-right: 100px;

        .img {
            display: flex;
            justify-content: center;
        }

        .description {
            margin-top: 50px;
    
            h3 {
                font-family: 'Mitr';
                font-weight: 900;
            }
    
            p {
                font-family: 'Mitr';
                text-indent: 3em;
            }
        }
    }

`

export default SomdetPark_Page