import React from "react"
import MainLayout from "../Layout/MainLayout"
import styled from "styled-components"

const Wasukri_beach = () => {

    const renderWasukri_beach = () => {
        return (
            <MainLayout>
                <StyledWrapper>
                    <div className="title">
                        <h1>หาดวาสุกรี</h1>
                    </div>
                    <div className="main-content">
                        <div className="img">
                            <img src="http://culture.yru.ac.th/images/9/9e/Wasukree2.jpg"
                                style={{
                                    width: "1000px",
                                    height: "600px"
                                }}
                            />
                        </div>
                        <div className="description">
                            <h3>จุดเด่น</h3>
                            <p>
                                หาดวาสุกรีเรียกอีกชื่อหนึ่งว่า ปาตาตีมอ ลักษณะเป็นหาดทรายกว้าง และขาวสะอาดมีความลาดชันน้อย ทอดตัวเป็นแนวยาวร่มรื่นด้วยทิวสน เหมาะแก่การพักผ่อน
                                เล่นน้ำและประกอบกิจกรรมริมชายหาดตามอัธยาศัย
                            </p>
                            <h3>สิ่งที่ดึงดูด</h3>
                            <p>
                                หาดวาสุกรีเป็นหาดทรายขาวสะอาดทอดยาวขนานกับฝั่งทะเล มีน้ำทะเลใสสะอาด จนสามารถมองเห็นทรายใต้น้ำได้ แต่เดิมหาดวาสุกรีเป็นหาดทรายโล่งขาดร่มเงาไม้สำหรับพักผ่อน
                                ต่อมาทางเทศบาลได้สร้างศาลาและปลูกต้นสนเรียงรายทั่วไป เพื่อให้เป็นที่พักผ่อนของผู้มาเยือน หาดวาสุกรีในยามค่ำคืนสวยงามมาก ท่ามกลางความมืด บนฝั่งแล้วทอดสายตาไปยังท้องทะเล
                                จะเห็นความงามของแสงไฟวับแวมของเรือประมงที่ออกจับปลาในเวลากลางคืน เฉกเช่นดวงดาวจากฟากฟ้าที่ตกลงมาลอยระยิบระยับอยู่เหนือท้องทะเล
                                ซึ่งเป็นภาพที่สร้างความประทับใจแก่ผู้มีโอกาสได้มาเยือนหาดทรายแห่งนี้ ถ้าต้องการสัมผัสธรรมชาติและบรรยากาศในยามเช้าตรู่ของที่นี่ก็คงไม่ผิดหวัง
                                ก็จะได้เห็นพระอาทิตย์ขึ้นในยามนี้ ค่อย ๆ โผล่ขึ้นจากขอบฟ้าซึ่งจดกับพื้นน้ำ ทอแสงสีแดงส้ม สวยงามกระทบกับน้ำทะเลเป็นประกายระยับในยามเช้าตรู่ เป็นภาพที่น่าชมยิ่งนัก
                            </p>
                            <h3>สิ่งอำนวยความสะดวกในการท่องเที่ยว</h3>
                            <p>
                                บริเวณหาดวาสุกรีจะมีร้านอาหารคอยบริการนักท่องเที่ยวที่มาเที่ยว หรือถ้าต้องการพักค้างคืนที่นั่นเพื่อรอดูพระอาทิตย์ขึ้นในยามเช้าตรู่ ก็จะมีบ้านพักที่สะอาดให้เช่าในราคาที่ไม่แพงนัก
                            </p>
                            <h3>สถานที่พักแรม</h3>
                            <p>
                                สามารถเดินทางมาพักผ่อนแบบไปเช้าเย็นกลับได้ หรือจะพักแรมมีบังกะโลเปิดบริการอยู่บริเวณหาด
                            </p>
                            <h3>การเดินทาง</h3>
                            <p>
                                จากตัวเมืองปัตตานีใช้เส้นทางหลวงสาย 42 ระยะทางประมาณ 50 กม. เมื่อถึงอำเภอสายบุรีใช้เส้นทางหลวงเดิมอีก 2 กม. หรือจะขับเลียบชายหาดทางหลวงหมายเลข 4157 ผ่านหาดชลาลัย หาดแฆแฆ ถึงหาดวาสุกรได้เช่นกัน
                            </p>
                        </div>
                    </div>
                </StyledWrapper>
            </MainLayout>
        )
    }

    return (
        <div>
            {renderWasukri_beach()}
        </div>
    )
}

const StyledWrapper = styled.div`
    margin: 0;

    .title {
        margin-top: 50px;
        margin-bottom: 50px;
        text-align: center;

        h1 {
            font-family: 'Mitr';
            font-size: 40px;
            font-weight: 900;
        }
    }

    .main-content {
        margin-bottom: 100px;
        margin-left: 100px;
        margin-right: 100px;

        .img {
            display: flex;
            justify-content: center;
        }

        .description {
            margin-top: 50px;
    
            h3 {
                font-family: 'Mitr';
                font-weight: 900;
            }
    
            p {
                font-family: 'Mitr';
                text-indent: 3em;
            }
        }
    }

`

export default Wasukri_beach